E-Lagori/Modules/D.ESP.WVR/1.0.0/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length

###################################################################

d_esp_wvr.name=D.ESP.WVR

d_esp_wvr.bootloader.tool=esptool_py
d_esp_wvr.bootloader.tool.default=esptool_py

d_esp_wvr.upload.tool=esptool_py
d_esp_wvr.upload.tool.default=esptool_py
d_esp_wvr.upload.tool.network=esp_ota

d_esp_wvr.upload.maximum_size=1310720
d_esp_wvr.upload.maximum_data_size=327680
d_esp_wvr.upload.flags=
d_esp_wvr.upload.extra_flags=

d_esp_wvr.serial.disableDTR=true
d_esp_wvr.serial.disableRTS=true

d_esp_wvr.build.tarch=xtensa
d_esp_wvr.build.bootloader_addr=0x1000
d_esp_wvr.build.target=esp32
d_esp_wvr.build.mcu=esp32
d_esp_wvr.build.core=esp32
d_esp_wvr.build.variant=D_ESP_WVR
d_esp_wvr.build.board=D_ESP_WVR

d_esp_wvr.build.f_cpu=240000000L
d_esp_wvr.build.flash_size=4MB
d_esp_wvr.build.flash_freq=40m
d_esp_wvr.build.flash_mode=dio
d_esp_wvr.build.boot=dio
d_esp_wvr.build.partitions=default
d_esp_wvr.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
d_esp_wvr.build.extra_libs=

d_esp_wvr.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
d_esp_wvr.menu.PartitionScheme.default.build.partitions=default
d_esp_wvr.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
d_esp_wvr.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
d_esp_wvr.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
d_esp_wvr.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
d_esp_wvr.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
d_esp_wvr.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
d_esp_wvr.menu.PartitionScheme.minimal.build.partitions=minimal
d_esp_wvr.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
d_esp_wvr.menu.PartitionScheme.no_ota.build.partitions=no_ota
d_esp_wvr.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
d_esp_wvr.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
d_esp_wvr.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
d_esp_wvr.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
d_esp_wvr.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
d_esp_wvr.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
d_esp_wvr.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
d_esp_wvr.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
d_esp_wvr.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
d_esp_wvr.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
d_esp_wvr.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
d_esp_wvr.menu.PartitionScheme.huge_app.build.partitions=huge_app
d_esp_wvr.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
d_esp_wvr.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
d_esp_wvr.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
d_esp_wvr.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
d_esp_wvr.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
d_esp_wvr.menu.PartitionScheme.fatflash.build.partitions=ffat
d_esp_wvr.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
d_esp_wvr.menu.PartitionScheme.rainmaker=RainMaker
d_esp_wvr.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
d_esp_wvr.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

d_esp_wvr.menu.FlashMode.qio=QIO
d_esp_wvr.menu.FlashMode.qio.build.flash_mode=dio
d_esp_wvr.menu.FlashMode.qio.build.boot=qio
d_esp_wvr.menu.FlashMode.dio=DIO
d_esp_wvr.menu.FlashMode.dio.build.flash_mode=dio
d_esp_wvr.menu.FlashMode.dio.build.boot=dio
d_esp_wvr.menu.FlashMode.qout=QOUT
d_esp_wvr.menu.FlashMode.qout.build.flash_mode=dout
d_esp_wvr.menu.FlashMode.qout.build.boot=qout
d_esp_wvr.menu.FlashMode.dout=DOUT
d_esp_wvr.menu.FlashMode.dout.build.flash_mode=dout
d_esp_wvr.menu.FlashMode.dout.build.boot=dout

d_esp_wvr.menu.FlashFreq.80=80MHz
d_esp_wvr.menu.FlashFreq.80.build.flash_freq=80m
d_esp_wvr.menu.FlashFreq.40=40MHz
d_esp_wvr.menu.FlashFreq.40.build.flash_freq=40m

d_esp_wvr.menu.UploadSpeed.921600=921600
d_esp_wvr.menu.UploadSpeed.921600.upload.speed=921600
d_esp_wvr.menu.UploadSpeed.115200=115200
d_esp_wvr.menu.UploadSpeed.115200.upload.speed=115200
d_esp_wvr.menu.UploadSpeed.256000.windows=256000
d_esp_wvr.menu.UploadSpeed.256000.upload.speed=256000
d_esp_wvr.menu.UploadSpeed.230400.windows.upload.speed=256000
d_esp_wvr.menu.UploadSpeed.230400=230400
d_esp_wvr.menu.UploadSpeed.230400.upload.speed=230400
d_esp_wvr.menu.UploadSpeed.460800.linux=460800
d_esp_wvr.menu.UploadSpeed.460800.macosx=460800
d_esp_wvr.menu.UploadSpeed.460800.upload.speed=460800
d_esp_wvr.menu.UploadSpeed.512000.windows=512000
d_esp_wvr.menu.UploadSpeed.512000.upload.speed=512000

d_esp_wvr.menu.DebugLevel.none=None
d_esp_wvr.menu.DebugLevel.none.build.code_debug=0
d_esp_wvr.menu.DebugLevel.error=Error
d_esp_wvr.menu.DebugLevel.error.build.code_debug=1
d_esp_wvr.menu.DebugLevel.warn=Warn
d_esp_wvr.menu.DebugLevel.warn.build.code_debug=2
d_esp_wvr.menu.DebugLevel.info=Info
d_esp_wvr.menu.DebugLevel.info.build.code_debug=3
d_esp_wvr.menu.DebugLevel.debug=Debug
d_esp_wvr.menu.DebugLevel.debug.build.code_debug=4
d_esp_wvr.menu.DebugLevel.verbose=Verbose
d_esp_wvr.menu.DebugLevel.verbose.build.code_debug=5

d_esp_wvr.menu.EraseFlash.none=Disabled
d_esp_wvr.menu.EraseFlash.none.upload.erase_cmd=
d_esp_wvr.menu.EraseFlash.all=Enabled
d_esp_wvr.menu.EraseFlash.all.upload.erase_cmd=-e
